def bubble_sort(lst): #задаем переменную
    n = 1 #пригодится в цикле
    while n < len(lst): #запускаем цикл, его нужно проделать кол-во раз = длине списка
         for i in range(len(lst)-n): #последний элемент не сравнить в элементом после него, т.к он сам последний.   
              if lst[i] > lst[i+1]: #если сравниваемый элемент больше того, с которым сравниваем
                   lst[i],lst[i+1] = lst[i+1],lst[i] # меняет их местами. Так до тех пор, пока не дойдет до конца или больше значения. Потом переходит к след элементу
         n += 1#необходимо для выполнения комента в 3 строке
    return lst



